import { Link } from "react-router-dom";

export default function Header() {
    return (
        <nav className="navbar py-4 py-lg-5 sticky-top">
            <div className="container position-relative">
                <div className="d-flex align-items-center me-auto">
                    <Link className="navbar-brand p-0 text-primary me-7" to="/">
                        <svg width="180" height="30" viewBox="0 0 144 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M19.9341 9.93199L19.0346 14.1297H22.4963V17.5369H18.2986L17.3174 22.1707H13.6921L14.6734 17.5369H9.71247L8.73119 22.1707H5.13317L6.11445 17.5369H1.99854V14.1297H6.85041L7.74991 9.93199H3.66126V6.52478H8.48587L9.43989 2H13.0379L12.0839 6.52478H17.0448L17.9988 2H21.6241L20.6701 6.52478H24.1591V9.93199H19.9341ZM16.3088 9.93199H11.3479L10.4484 14.1297H15.4093L16.3088 9.93199Z" fill="currentColor"/>
                            <path d="M38.8237 18.9543H47.3826V22.1707H34.408V19.2269L42.9124 6.36123H34.408V3.14482H47.3826V6.08866L38.8237 18.9543Z" fill="currentColor"/>
                            <path d="M60.0076 22.3615C58.2268 22.3615 56.5913 21.9436 55.1012 21.1077C53.6111 20.2717 52.43 19.1178 51.5577 17.6459C50.6855 16.1558 50.2494 14.4749 50.2494 12.6032C50.2494 10.7497 50.6855 9.087 51.5577 7.61509C52.43 6.125 53.6111 4.962 55.1012 4.1261C56.5913 3.2902 58.2268 2.87225 60.0076 2.87225C61.8066 2.87225 63.4421 3.2902 64.914 4.1261C66.4041 4.962 67.5762 6.125 68.4303 7.61509C69.3025 9.087 69.7386 10.7497 69.7386 12.6032C69.7386 14.4749 69.3025 16.1558 68.4303 17.6459C67.5762 19.1178 66.4041 20.2717 64.914 21.1077C63.4239 21.9436 61.7885 22.3615 60.0076 22.3615ZM60.0076 18.9543C61.1525 18.9543 62.161 18.6999 63.0332 18.1911C63.9055 17.6641 64.5869 16.9191 65.0776 15.9559C65.5682 14.9928 65.8135 13.8753 65.8135 12.6032C65.8135 11.3312 65.5682 10.2227 65.0776 9.27781C64.5869 8.3147 63.9055 7.57874 63.0332 7.06993C62.161 6.56112 61.1525 6.30672 60.0076 6.30672C58.8628 6.30672 57.8452 6.56112 56.9548 7.06993C56.0825 7.57874 55.4011 8.3147 54.9104 9.27781C54.4198 10.2227 54.1745 11.3312 54.1745 12.6032C54.1745 13.8753 54.4198 14.9928 54.9104 15.9559C55.4011 16.9191 56.0825 17.6641 56.9548 18.1911C57.8452 18.6999 58.8628 18.9543 60.0076 18.9543Z" fill="currentColor"/>
                            <path d="M83.9169 12.4124C84.989 12.6123 85.8704 13.1484 86.5609 14.0206C87.2514 14.8929 87.5967 15.8923 87.5967 17.019C87.5967 18.0366 87.3423 18.9361 86.8335 19.7175C86.3428 20.4807 85.625 21.0804 84.6801 21.5165C83.7352 21.9526 82.6176 22.1707 81.3274 22.1707H73.1228V3.14482H80.9731C82.2633 3.14482 83.3717 3.3538 84.2985 3.77175C85.2434 4.1897 85.9521 4.7712 86.4246 5.51624C86.9152 6.26129 87.1606 7.10628 87.1606 8.05121C87.1606 9.15969 86.8607 10.0865 86.261 10.8315C85.6796 11.5765 84.8982 12.1035 83.9169 12.4124ZM76.9389 10.995H80.4279C81.3365 10.995 82.0361 10.7952 82.5267 10.3954C83.0174 9.97742 83.2627 9.38684 83.2627 8.62362C83.2627 7.86041 83.0174 7.26982 82.5267 6.85187C82.0361 6.43392 81.3365 6.22494 80.4279 6.22494H76.9389V10.995ZM80.7822 19.0633C81.709 19.0633 82.4268 18.8453 82.9356 18.4091C83.4626 17.973 83.7261 17.3552 83.7261 16.5556C83.7261 15.7379 83.4535 15.1019 82.9084 14.6476C82.3632 14.1751 81.6272 13.9389 80.7005 13.9389H76.9389V19.0633H80.7822Z" fill="currentColor"/>
                            <path d="M102.85 18.5454H95.2719L94.018 22.1707H90.0111L96.8528 3.11756H101.296L108.138 22.1707H104.103L102.85 18.5454ZM101.814 15.4926L99.0607 7.53331L96.3077 15.4926H101.814Z" fill="currentColor"/>
                            <path d="M122.906 18.5454H115.329L114.075 22.1707H110.068L116.91 3.11756H121.353L128.194 22.1707H124.16L122.906 18.5454ZM121.87 15.4926L119.117 7.53331L116.364 15.4926H121.87Z" fill="currentColor"/>
                            <path d="M142.931 3.82191L139.102 16.4259L135.995 15.5934L138.955 2.75663L142.931 3.82191ZM135.977 22.1918C135.31 22.0131 134.811 21.6631 134.48 21.1418C134.172 20.6076 134.1 20.0334 134.265 19.4191C134.429 18.8047 134.776 18.3521 135.306 18.0613C135.858 17.7576 136.467 17.6951 137.134 17.8739C137.783 18.0479 138.262 18.402 138.571 18.9361C138.884 19.4527 138.958 20.0181 138.793 20.6325C138.629 21.2468 138.279 21.7082 137.745 22.0166C137.216 22.3074 136.626 22.3658 135.977 22.1918Z" fill="currentColor"/>
                        </svg>
                    </Link>

                    <form className="position-relative d-none d-lg-block bg-white">
                        <span className="material-symbols-outlined align-bottom position-absolute top-50 start-0 translate-middle-y ps-4 text-neutral-60">
                        search
                        </span>
                        <input
                        type="search"
                        className="form-control rounded-1 py-2 ps-10 border-2 navbar-lg-search"
                        id="navbar-lg-search"
                        placeholder="搜尋景點、地點或城市"
                        />
                    </form>
                </div>

                <div className="d-lg-none">
                    <div className="position-absolute start-0 end-0 px-4 z-1 bg-neutral-white">
                        <div className="collapse" id="collapseExample">
                            <div className="d-flex align-items-center">
                                <form className="position-relative w-100">
                                    <span className="material-symbols-outlined align-bottom position-absolute top-50 start-0 translate-middle-y ps-4 text-neutral-60">
                                    search
                                    </span>
                                    <input
                                    type="search"
                                    className="form-control rounded-1 py-2 ps-10 border-2"
                                    id="exampleFormControlInput1"
                                    placeholder="搜尋景點、地點或城市"
                                    />
                                </form>
                                <button
                                    type="button"
                                    className="btn btn-icon p-2 shadow-none"
                                    data-bs-toggle="collapse"
                                    data-bs-target="#collapseExample"
                                >
                                    <span className="material-symbols-outlined align-bottom">close</span>
                                </button>
                            </div>
                        </div>
                    </div>

                    <button
                        type="button"
                        className="btn btn-icon p-2 shadow-none d-lg-none"
                        data-bs-toggle="collapse"
                        data-bs-target="#collapseExample"
                        >
                        <span className="material-symbols-outlined align-bottom">search</span>
                    </button>
                </div>
                


                <Link to="#" className="btn btn-icon shadow-none">
                    <span className="position-relative">
                        {/* <span className="position-absolute top-0 start-100 translate-middle badge rounded-circle bg-alert p-0 cart-tag">
                        2
                        </span> */}
                        <span className="material-symbols-outlined align-bottom">shopping_cart</span>
                    </span>
                </Link>

                <Link to="/login" type="button" className="btn btn-primary py-3 px-5 ms-3 d-none d-lg-block">
                登入 / 註冊
                </Link>

                <button className="btn btn-icon shadow-none p-2 d-lg-none"
                    type="button"
                    data-bs-toggle="offcanvas"
                    data-bs-target="#offcanvasNavbar"
                    aria-controls="offcanvasNavbar"
                    aria-label="Toggle navigation" >
                    <span className="material-symbols-outlined align-bottom">menu</span>
                </button>

                <div className="offcanvas offcanvas-end w-75 d-lg-none"
                tabIndex={-1}
                id="offcanvasNavbar"
                aria-labelledby="offcanvasNavbarLabel"
                >
                    <div className="offcanvas-header">
                        <button type="button" className="btn-close" data-bs-dismiss="offcanvas" aria-label="Close" />
                    </div>
                    <div className="offcanvas-body">
                        <ul className="navbar-nav h-100 flex-grow-1 pe-3">
                            <li className="d-flex align-items-center gap-2 border-bottom border-neutral-40 pb-5 mb-5">
                                {/* <img src="src/assets/images/user.png" alt="user-pic" className="user-pic my-2" /> */}
                                <span className="bg-primary-40 p-1 rounded-circle">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M16 9C16 10.0609 15.5786 11.0783 14.8284 11.8284C14.0783 12.5786 13.0609 13 12 13C10.9391 13 9.92172 12.5786 9.17157 11.8284C8.42143 11.0783 8 10.0609 8 9C8 7.93913 8.42143 6.92172 9.17157 6.17157C9.92172 5.42143 10.9391 5 12 5C13.0609 5 14.0783 5.42143 14.8284 6.17157C15.5786 6.92172 16 7.93913 16 9ZM14 9C14 9.53043 13.7893 10.0391 13.4142 10.4142C13.0391 10.7893 12.5304 11 12 11C11.4696 11 10.9609 10.7893 10.5858 10.4142C10.2107 10.0391 10 9.53043 10 9C10 8.46957 10.2107 7.96086 10.5858 7.58579C10.9609 7.21071 11.4696 7 12 7C12.5304 7 13.0391 7.21071 13.4142 7.58579C13.7893 7.96086 14 8.46957 14 9Z" fill="#F3EEEC"/>
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M12 1C5.925 1 1 5.925 1 12C1 18.075 5.925 23 12 23C18.075 23 23 18.075 23 12C23 5.925 18.075 1 12 1ZM3 12C3 14.09 3.713 16.014 4.908 17.542C5.74723 16.4399 6.8299 15.5467 8.07143 14.9323C9.31297 14.3179 10.6797 13.9988 12.065 14C13.4323 13.9987 14.7819 14.3095 16.0109 14.9088C17.2399 15.508 18.316 16.3799 19.157 17.458C20.0234 16.3216 20.6068 14.9952 20.8589 13.5886C21.111 12.182 21.0244 10.7355 20.6065 9.36898C20.1886 8.00243 19.4512 6.75505 18.4555 5.73004C17.4598 4.70503 16.2343 3.93186 14.8804 3.47451C13.5265 3.01716 12.0832 2.88877 10.6699 3.09997C9.25652 3.31117 7.91379 3.85589 6.75277 4.68905C5.59175 5.52222 4.64581 6.61987 3.99323 7.8912C3.34065 9.16252 3.00018 10.571 3 12ZM12 21C9.93395 21.0031 7.93027 20.2923 6.328 18.988C6.97293 18.0647 7.83134 17.3109 8.83019 16.7907C9.82905 16.2705 10.9388 15.9992 12.065 16C13.1772 15.9991 14.2735 16.2636 15.2629 16.7714C16.2524 17.2793 17.1064 18.0159 17.754 18.92C16.1393 20.2667 14.1026 21.0029 12 21Z" fill="#F3EEEC"/>
                                    </svg>
                                </span>

                                <div>
                                    <h2 className="fs-6 fw-bold m-0">訪客</h2>
                                    <p className="fs-6 m-0 text-neutral-80">未登入</p>
                                </div>
                            </li>

                            {/* <li className="nav-item">
                                <Link className="nav-link py-4 text-neutral-0" to="#">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" className="align-bottom me-2">
                                    <path d="M17 4H7C5.89543 4 5 4.89543 5 6V19C5 20.1046 5.89543 21 7 21H17C18.1046 21 19 20.1046 19 19V6C19 4.89543 18.1046 4 17 4Z" stroke="currentColor" strokeWidth="2"/>
                                    <path d="M9 9H15M9 13H15M9 17H13" stroke="currentColor" strokeWidth="2" strokeLinecap="round"/>
                                </svg>
                                訂單管理
                                </Link>
                            </li>

                            <li className="nav-item">
                                <Link className="nav-link py-4 text-neutral-0" to="#">
                                <span className="material-symbols-outlined align-bottom me-2">favorite</span>
                                我的收藏
                                </Link>
                            </li>

                            <li className="nav-item">
                                <Link className="nav-link py-4 text-neutral-0" to="#">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" className="align-bottom me-2">
                                    <path d="M19.8999 12.6599C19.7396 12.4774 19.6512 12.2428 19.6512 11.9999C19.6512 11.757 19.7396 11.5224 19.8999 11.3399L21.1799 9.89989C21.3209 9.74256 21.4085 9.5446 21.4301 9.3344C21.4516 9.12421 21.4061 8.91258 21.2999 8.72989L19.2999 5.2699C19.1948 5.08742 19.0348 4.94277 18.8426 4.85658C18.6505 4.77039 18.4361 4.74705 18.2299 4.7899L16.3499 5.1699C16.1107 5.21932 15.8616 5.17948 15.6498 5.0579C15.4379 4.93631 15.2779 4.74138 15.1999 4.5099L14.5899 2.6799C14.5228 2.48127 14.395 2.30876 14.2245 2.18674C14.0541 2.06471 13.8495 1.99935 13.6399 1.9999H9.6399C9.42183 1.98851 9.20603 2.04882 9.02546 2.17161C8.84489 2.2944 8.70948 2.47291 8.6399 2.6799L8.0799 4.5099C8.0019 4.74138 7.84187 4.93631 7.63001 5.0579C7.41815 5.17948 7.16911 5.21932 6.9299 5.1699L4.9999 4.7899C4.80445 4.76228 4.6052 4.79312 4.42724 4.87853C4.24929 4.96395 4.1006 5.10012 3.9999 5.2699L1.9999 8.72989C1.89106 8.91054 1.84212 9.12098 1.86008 9.33112C1.87804 9.54126 1.96198 9.74034 2.0999 9.89989L3.3699 11.3399C3.53022 11.5224 3.61863 11.757 3.61863 11.9999C3.61863 12.2428 3.53022 12.4774 3.3699 12.6599L2.0999 14.0999C1.96198 14.2595 1.87804 14.4585 1.86008 14.6687C1.84212 14.8788 1.89106 15.0892 1.9999 15.2699L3.9999 18.7299C4.10499 18.9124 4.26502 19.057 4.45715 19.1432C4.64928 19.2294 4.86372 19.2527 5.0699 19.2099L6.9499 18.8299C7.18911 18.7805 7.43815 18.8203 7.65001 18.9419C7.86187 19.0635 8.0219 19.2584 8.0999 19.4899L8.7099 21.3199C8.77948 21.5269 8.91489 21.7054 9.09546 21.8282C9.27603 21.951 9.49183 22.0113 9.7099 21.9999H13.7099C13.9195 22.0004 14.1241 21.9351 14.2945 21.8131C14.465 21.691 14.5928 21.5185 14.6599 21.3199L15.2699 19.4899C15.3479 19.2584 15.5079 19.0635 15.7198 18.9419C15.9316 18.8203 16.1807 18.7805 16.4199 18.8299L18.2999 19.2099C18.5061 19.2527 18.7205 19.2294 18.9126 19.1432C19.1048 19.057 19.2648 18.9124 19.3699 18.7299L21.3699 15.2699C21.4761 15.0872 21.5216 14.8756 21.5001 14.6654C21.4785 14.4552 21.3909 14.2572 21.2499 14.0999L19.8999 12.6599ZM11.6399 7.9999C10.8488 7.9999 10.0754 8.23449 9.41761 8.67402C8.75982 9.11354 8.24713 9.73826 7.94438 10.4692C7.64163 11.2001 7.56241 12.0043 7.71675 12.7803C7.8711 13.5562 8.25206 14.2689 8.81147 14.8283C9.37088 15.3877 10.0836 15.7687 10.8595 15.923C11.6355 16.0774 12.4397 15.9982 13.1706 15.6954C13.9015 15.3927 14.5262 14.88 14.9658 14.2222C15.4053 13.5644 15.6399 12.791 15.6399 11.9999C15.6399 10.939 15.2185 9.92161 14.4683 9.17147C13.7182 8.42132 12.7008 7.9999 11.6399 7.9999ZM11.6399 13.9999C11.2443 13.9999 10.8577 13.8826 10.5288 13.6628C10.1999 13.4431 9.94351 13.1307 9.79214 12.7653C9.64076 12.3998 9.60116 11.9977 9.67833 11.6097C9.7555 11.2218 9.94598 10.8654 10.2257 10.5857C10.5054 10.306 10.8618 10.1155 11.2497 10.0383C11.6377 9.96115 12.0398 10.0008 12.4053 10.1521C12.7707 10.3035 13.0831 10.5599 13.3028 10.8888C13.5226 11.2177 13.6399 11.6043 13.6399 11.9999C13.6399 12.5303 13.4292 13.039 13.0541 13.4141C12.679 13.7892 12.1703 13.9999 11.6399 13.9999Z" fill="currentColor"/>
                                </svg>
                                帳號設定
                                </Link>
                            </li> */}
                            <li>
                                <h3 className="fs-6 mb-1">歡迎來到 ZOBAA</h3>
                                <p>加入會員即可立即訂購、收藏行程，並享相關優惠好禮。</p>
                            </li>

                            {/* <li className="mt-auto">
                                <button type="button" className="btn w-100 text-start p-0 py-4 text-neutral-80">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" className="text-neutral-60 align-bottom me-2">
                                    <path d="M20.15 13H8V11H20.15L18.6 9.45L20 8L24 12L20 16L18.6 14.55L20.15 13ZM15 9V5H5V19H15V15H17V19C17 19.55 16.8042 20.0208 16.4125 20.4125C16.0208 20.8042 15.55 21 15 21H5C4.45 21 3.97917 20.8042 3.5875 20.4125C3.19583 20.0208 3 19.55 3 19V5C3 4.45 3.19583 3.97917 3.5875 3.5875C3.97917 3.19583 4.45 3 5 3H15C15.55 3 16.0208 3.19583 16.4125 3.5875C16.8042 3.97917 17 4.45 17 5V9H15Z" fill="currentColor"/>
                                </svg>
                                登出
                                </button>
                            </li> */}
                            <li className="mt-auto">
                                <Link to="/login" type="button" className="btn btn-primary w-100 py-4">
                                    登入 / 註冊
                                </Link>
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
        </nav>
    );
}